---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.StairsOtherThan2IntsByRiserAndBoundaryFailure
source: html/6ea387d6-96f2-1bd9-d581-f488420fffd0.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.StairsOtherThan2IntsByRiserAndBoundaryFailure Property

More than 2 intersection points between riser segment and boundary encountered

## Syntax (C#)
```csharp
public static FailureDefinitionId StairsOtherThan2IntsByRiserAndBoundaryFailure { get; }
```